Revit 2026 API

# CurveUVGetEndParameter Method

---

Gets the raw parameter value at the start or end of this curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetEndParameter(
	int index
)
```
```vb
Public Function GetEndParameter (
	index As Integer
) As Double
```
```cpp
public:
double GetEndParameter(
	int index
)
```
```fsharp
member GetEndParameter :
        index : int -> float
```

#### Parameters

index Int32
     Use 0 for the start parameter, 1 for the end parameter of the curve.

#### Return Value

Double The raw parameter value at the start or end of this curve.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The given value for index is not 0 or 1. |
| InvalidOperationException | This curve is unbound and does not have start and end points. |

#### Reference

CurveUV Class

Autodesk.Revit.DB Namespace